CSI API ETABS v1
cPropTendon.SetProp Method
 Defines a tendon property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetProp(
	string Name,
	string MatProp,
	int ModelingOption,
	double Area,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetProp (
	Name As String,
	MatProp As String,
	ModelingOption As Integer,
	Area As Double,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropTendon
Dim Name As String
Dim MatProp As String
Dim ModelingOption As Integer
Dim Area As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetProp(Name, MatProp,
	ModelingOption, Area, Color, Notes,
	GUID)
int SetProp(
	String^ Name,
	String^ MatProp,
	int ModelingOption,
	double Area,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetProp :
        Name : string *
        MatProp : string *
        ModelingOption : int *
        Area : float *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing or new tendon property. If this is an existing property, that property is modified; otherwise, a new property is added.
MatProp
Type: System.String
The name of the material property assigned to the tendon property.
ModelingOption
Type: System.Int32
This is either 1 or 2, indicating the tendon modeling option.
Value | Modeling Option
1 | Model tendon as loads
2 | Model tendon as elements
Area
Type: System.Double
The cross-sectional area of the tendon. [L2]
Color (Optional)
Type: System.Int32
Notes (Optional)
Type: System.String
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the property. If this item is input as Default, the program assigns a GUID to the property
Return Value
Type: Int32
Returns zero if the property is successfully defined; otherwise it returns a nonzero value.
Remarks
Modeling tendons as elements (ModelingOption = 2) is not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add tendon material
       ret = SapModel.PropMaterial.AddQuick(Name, eMatType.Tendon, , , , , , eMatTypeTendon.ASTM_A416Gr270)
   'set new tendon property
       ret = SapModel.PropTendon.SetProp("T1", Name, 1, 2.25)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropTendon Interface
ETABSv1 Namespace